OdDAI.DefinedType.isSupertypeOf(OdDAI.DefinedType!System.Runtime.CompilerServices.IsConst*)
\details
Check whether the Defined Type is a supertype of another Defined Type.
\param subtype [in] A Defined Type to check.
\returns true if the object is a supertype of the specified Defined Type type; otherwise, the method returns false.

OdDAI.DefinedType.#ctor(OdDAI.Schema*,OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,std.shared_ptr&lt;OdTypeCode&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdSmartPtr&lt;OdDAI.UnderlyingType&gt;)
\details
Creates a new defined type object with specified parameters.
\param parentSchema [in] A raw pointer to a schema in which defined type is declared.
\param name         [in] A name of the defined type.
\param typeCode     [in] A smart pointer to a type code of defined type.
\param domain       [in] A smart pointer to an underlying type of defined type.

OdDAI.DefinedType.#ctor
\details
Creates a new defined type object with default parameters.

OdDAI.DefinedType
\details
A class that implements the storing of types established as a result of EXPRESS TYPE declaration.
\sa
IFC Data Types.